#+TITLE: Raspberry Pi

* Raspberry Pi
   :PROPERTIES:
   :header-args: :dir ~/Documents/raspberryPi
   :END:

** Writing image

ref : https://gist.github.com/jordelver/3139365

#+BEGIN_SRC sh :exports both :results output
diskutil list
#+END_SRC

#+RESULTS:
#+begin_example
/dev/disk0 (internal, physical):
   #:                       TYPE NAME                    SIZE       IDENTIFIER
   0:      GUID_partition_scheme                        *121.3 GB   disk0
   1:                        EFI EFI                     209.7 MB   disk0s1
   2:          Apple_CoreStorage Macintosh HD            121.0 GB   disk0s2
   3:                 Apple_Boot Boot OS X               134.2 MB   disk0s3

/dev/disk1 (internal, physical):
   #:                       TYPE NAME                    SIZE       IDENTIFIER
   0:      GUID_partition_scheme                        *2.0 TB     disk1
   1:                        EFI EFI                     209.7 MB   disk1s1
   2:          Apple_CoreStorage Macintosh HD            2.0 TB     disk1s2
   3:                 Apple_Boot Recovery HD             650.0 MB   disk1s3

/dev/disk2 (internal, virtual):
   #:                       TYPE NAME                    SIZE       IDENTIFIER
   0:                  Apple_HFS Macintosh HD           +2.1 TB     disk2
                                 Logical Volume on disk0s2, disk1s2
                                 D076811B-902F-4057-BD0F-603F9338DC36
                                 Unencrypted Fusion Drive

/dev/disk3 (internal, physical):
   #:                       TYPE NAME                    SIZE       IDENTIFIER
   0:     FDisk_partition_scheme                        *31.9 GB    disk3
   1:             Windows_FAT_32 boot                    43.5 MB    disk3s1
   2:                      Linux                         31.9 GB    disk3s2

/dev/disk4 (disk image):
   #:                       TYPE NAME                    SIZE       IDENTIFIER
   0:     Apple_partition_scheme                        +24.3 MB    disk4
   1:        Apple_partition_map                         32.3 KB    disk4s1
   2:                  Apple_HFS Flash Player            24.2 MB    disk4s2

#+end_example

#+BEGIN_SRC sh
diskutil unmountDisk /dev/disk3
#+END_SRC

#+RESULTS:
: Unmount of all volumes on disk3 was successful

#+BEGIN_SRC sh
dd if=.img of=/dev/rdisk3 bs=1m
#+END_SRC

** Credentials

user : pi
password : raspberry

